# 2. Напишите программу для определения, является ли введенное число а
# четным или нечетным.
a = int(input("Введите число a: "))

if a % 2 == 0:
    print("четное.")
else:
    print("нечетное.")

