# 1. Тело получило ускорение а под действием силы F. Если значения F и а
# равны следующим значениям, напишите программу для расчета массы тела
# (m = F / a):
# a) F = 25, a = 45;
# b) F = 12, a = 30;
# d) F = 72, a = 90;
# e) F = 150, a = 15.

# Первый случай
F1 = 25
a1 = 45
m1 = F1 / a1
print("При F =", F1, "Н и a =", a1, "м/с², масса тела m =", m1, "кг")

# Второй случай
F2 = 12
a2 = 30
m2 = F2 / a2
print("При F =", F2, "Н и a =", a2, "м/с², масса тела m =", m2, "кг")

# Третий случай
F3 = 72
a3 = 90
m3 = F3 / a3
print("При F =", F3, "Н и a =", a3, "м/с², масса тела m =", m3, "кг")

# Четвертый случай
F4 = 150
a4 = 15
m4 = F4 / a4
print("При F =", F4, "Н и a =", a4, "м/с², масса тела m =", m4, "кг")
