# 2. Напишите программу для определения, является ли прямоугольник со
# сторонами а и b квадратом.

a = float(input("Введите длину стороны a: "))
b = float(input("Введите длину стороны b: "))
if a == b:
    print("Прямоугольник является квадратом.")
else:
    print("Прямоугольник НЕ является квадратом.")

