# 1. Длина основания треугольника (с) и высоты (h) вводится пользователем.
# Напишите программу вычисления площади треугольника (S).

c = float(input("Введите длину основания треугольника (c): "))
h = float(input("Введите высоту треугольника (h): "))

S = (c * h) / 2
print("Площадь треугольника:", S)
